app/Http/Controllers/AssignRoleController.php

    public function index()
    {
        $currUserId = auth()->id();
        $currOrgId = DB::table('organization_user')->where('user_id', '=', $currUserId)->pluck('organization_id')->first();
        $currOrg = Organization::with('studentOrg')->where('id', '=', $currOrgId)->first();
---
select `organization_id` from `organization_user` where `user_id` = 6
select * from `organizations` where `id` = 1 limit 1
select `users`.*, `organization_user`.`organization_id` as `pivot_organization_id`, `organization_user`.`user_id` as `pivot_user_id`, `organization_user`.`position` as `pivot_position`, `organization_user`.`created_at` as `pivot_created_at`, `organization_user`.`updated_at` as `pivot_updated_at` from `users` inner join `organization_user` on `users`.`id` = `organization_user`.`user_id` where `organization_user`.`organization_id` in (1)